Revit 2024 API
CompoundStructure.GetLayerAssociatedToRegion Method
 Gets the layer associated to a particular region.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public int GetLayerAssociatedToRegion(
	int regionId
)
Visual Basic
Public Function GetLayerAssociatedToRegion ( _
	regionId As Integer _
) As Integer
Visual C++
public:
int GetLayerAssociatedToRegion(
	int regionId
)
Parameters
regionId
Type: System.Int32
 The id of a region.
Return Value
 The index of a layer in this CompoundStructure.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentsInconsistentException |  For a non-vertically compound structure, implicitly each layer is associated to its corresponding simple region.
See Also
CompoundStructure Class
Autodesk.Revit.DB Namespace